#include <iostream>
using namespace std;
// 20.Дано значення кута α в градусах(0 ≤ α < 360).Обчислити значення цього ж кута
//в радіанах, враховуючи, що 180 ° = π радіанів.Значення π вважати рівним 3.14.

int main() {
    // Константа π
    const double PI = 3.14;

    // Змінна для кута в градусах
    double alphaDegrees;
    cout << "Введіть кут у градусах (0 <= α < 360): ";
    cin >> alphaDegrees;

    // Переведення у радіани
    double alphaRadians = alphaDegrees * PI / 180.0;

    // Вивід результату
    cout << "Кут у радіанах: " << alphaRadians << endl;

    return 0;
}


//2.Дана сторона квадрата a. Знайти його площу S = a2

int main() {
    // Змінна для сторони квадрата
    double a;
    cout << "Введіть сторону квадрата a: ";
    cin >> a;

    // Площа квадрата
    double S = a * a;

    // Вивід результату
    cout << "Площа квадрата: " << S << endl;

    return 0;
}


//50.Дано три дійсних числа a, b, c. Знайти їх середнє арифметичне M = (a
//+ b + c) / 3 та суму квадратів Q = a² + b² + c².Вхідні дані : a, b, c –
//дійсні.Вихідні дані : M, Q – дійсні.

int main() {
    // Змінні для трьох чисел
    double a, b, c;
    cout << "Введіть три числа (a, b, c): ";
    cin >> a >> b >> c;

    // Середнє арифметичне
    double M = (a + b + c) / 3.0;

    // Сума квадратів
    double Q = a * a + b * b + c * c;

    // Вивід результатів
    cout << "Середнє арифметичне M = " << M << endl;
    cout << "Сума квадратів Q = " << Q << endl;

    return 0;
}
